Tsung Results/Test3-SinglePassengerM3-20151105-0414/simple.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="54.236.178.35" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="8" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="5" duration="30" unit="second">
     <users arrivalrate="16" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="6" duration="35" unit="second">
     <users arrivalrate="20" unit="second"/>
   </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="example-user-navigation" probability="100" type="ts_http">

      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="username"/>
      </setdynvars>

      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/users/sign_up" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/users" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=%%_username%%%40a.com&amp;user%5Bpassword%5D=12345678&amp;user%5Bpassword_confirmation%5D=12345678&amp;commit=Sign+Up">
        </http>
      </request>

      <thinktime value="2" random="true"/>

      <request>
	<http url="/notes/new" version="1.1" method="GET"/>
      </request>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="random_title"/>
        <var name="random_content"/>
      </setdynvars>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>

    </session>
  </sessions>
</tsung>